app/controllers/pictures_controller.rb

SELECT  "pictures".* FROM "pictures"  WHERE "pictures"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @picture = Picture.find(params[:id])

INSERT INTO "pictures" ("artist", "created_at", "title", "updated_at", "url") VALUES (?, ?, ?, ?, ?)
---
  def create
    @picture = Picture.new(picture_params)
    if @picture.save

SELECT  "pictures".* FROM "pictures"  WHERE "pictures"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @picture = Picture.find(params[:id])

SELECT  "pictures".* FROM "pictures"  WHERE "pictures"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "pictures" SET "artist" = ?, "updated_at" = ? WHERE "pictures"."id" = 1  [["artist", "Arjun Bali"], ["updated_at", "2014-06-20 13:35:49.961040"]]
---
  def update
    @picture = Picture.find(params[:id])

    if @picture.update_attributes(picture_params)

SELECT  "pictures".* FROM "pictures"  WHERE "pictures"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "pictures" WHERE "pictures"."id" = ?  [["id", 1]]
---
  def destroy
    @picture = Picture.find(params[:id])
    @picture.destroy